Revit 2025 API
RailSupportsLayout Enumeration
 The layout of the rail supports.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum RailSupportsLayout
Public Enumeration RailSupportsLayout
public enum class RailSupportsLayout
type RailSupportsLayout
Members
Member name | Value | Description
None | 0 |  No rail support.
FixedDistance | 1 |  The rail supports are laid out on a fixed distance spacing.
AlignWithRailingPosts | 2 |  The rail supports are laid out aligned with the railing posts.
FixedNumber | 3 |  The rail supports are laid out with a specified fixed number.
MaxSpacing | 4 |  The rail supports are laid out with a maximum spacing.
MinSpacing | 5 |  The rail supports are laid out with a minimum spacing.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace